<?xml version="1.0" ?>
<net name="forward-tacotron-regression" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1, 805, 512" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="data">
					<dim>1</dim>
					<dim>805</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="248" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_6" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>805</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="269">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="ConstantOfShape_5/Broadcast/FillValue" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="24" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="689" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="26" size="8"/>
			<output>
				<port id="0" precision="I64" names="689">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Shape_0" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>805</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="259">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="34" size="4"/>
			<output>
				<port id="0" precision="I32" names="260"/>
			</output>
		</layer>
		<layer id="7" name="Gather_2/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="8" name="Gather_2284" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="261"/>
			</output>
		</layer>
		<layer id="9" name="Unsqueeze_3/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Unsqueeze_3/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="265">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="690" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="46" size="8"/>
			<output>
				<port id="0" precision="I64" names="690">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_4" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="267">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="ConstantOfShape_5/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="268">
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="217313896" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="ConstantOfShape_5/Broadcast/Output_0/Data_/DecomposedBiLSTM_0" type="Split" version="opset1">
			<data num_splits="2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="LSTM_7/Split/forward/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="LSTM_7/Split/forward/ShapeOf/Indices224613944" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="54" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="LSTM_7/Split/forward/ShapeOf/Axis224714151" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="19" name="LSTM_7/Split/forward/ShapeOf/Gather" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="LSTM_7/Split/forward/HiddenStateResizeDim/value225114079" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="46" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="LSTM_7/Split/forward/HiddenStateResizeDim" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="LSTM_7/Split/forward/HiddenStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="217813851" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="24" name="ConstantOfShape_5/Broadcast/Output_0/Data_/DecomposedBiLSTM_02179" type="Split" version="opset1">
			<data num_splits="2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="LSTM_7/Split/forward/CellStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="LSTM_7/Split/forward/TensorIterator" type="TensorIterator" version="opset1">
			<port_map>
				<input axis="0" external_port_id="0" internal_layer_id="2" start="0" end="-1" stride="1" part_size="1"/>
				<input external_port_id="1" internal_layer_id="1"/>
				<input external_port_id="2" internal_layer_id="0"/>
				<output axis="0" external_port_id="3" internal_layer_id="11" start="0" end="-1" stride="1" part_size="1"/>
				<output external_port_id="4" internal_layer_id="13"/>
				<output external_port_id="5" internal_layer_id="12"/>
			</port_map>
			<back_edges>
				<edge from-layer="13" to-layer="1"/>
				<edge from-layer="12" to-layer="0"/>
			</back_edges>
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="0" name="24" type="Parameter" version="opset1">
						<data shape="1, 512" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="22" type="Parameter" version="opset1">
						<data shape="1, 512" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="20" type="Parameter" version="opset1">
						<data shape="1, 1, 512" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="7250" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="38" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="LSTM_7/Split/forward/input_squeeze" type="Squeeze" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="LSTM_7/Split/forward/LSTMCell/Split197247" type="Const" version="opset1">
						<data element_type="f16" shape="2048, 512" offset="58" size="2097152"/>
						<output>
							<port id="0" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="LSTM_7/Split/forward/LSTMCell/Split198256" type="Const" version="opset1">
						<data element_type="f16" shape="2048, 512" offset="2097210" size="2097152"/>
						<output>
							<port id="0" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="LSTM_7/Split/forward/inport/2253" type="Const" version="opset1">
						<data element_type="f16" shape="2048" offset="4194362" size="4096"/>
						<output>
							<port id="0" precision="FP16">
								<dim>2048</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="LSTM_7/Split/forward/LSTMCell" type="LSTMCell" version="opset4">
						<data hidden_size="512" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0"/>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="3" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
							<port id="4" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
							<port id="5" precision="FP16">
								<dim>2048</dim>
							</port>
						</input>
						<output>
							<port id="6" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="7" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="15244" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="38" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="LSTM_7/Split/forwardoutput_unsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="18/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
					<layer id="12" name="LSTM_7/Split/forward/outport/1/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
					<layer id="13" name="LSTM_7/Split/forward/outport/0/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="8" to-port="2"/>
					<edge from-layer="1" from-port="0" to-layer="8" to-port="1"/>
					<edge from-layer="2" from-port="0" to-layer="4" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
					<edge from-layer="4" from-port="2" to-layer="8" to-port="0"/>
					<edge from-layer="5" from-port="0" to-layer="8" to-port="3"/>
					<edge from-layer="6" from-port="0" to-layer="8" to-port="4"/>
					<edge from-layer="7" from-port="0" to-layer="8" to-port="5"/>
					<edge from-layer="8" from-port="6" to-layer="10" to-port="0"/>
					<edge from-layer="8" from-port="7" to-layer="12" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="13" to-port="0"/>
					<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
					<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="27" name="223914100" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="LSTM_7/Split/forward/UnsqueezeNumDirections/2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="LSTM_7/Split/reverse/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="LSTM_7/Split/reverse/ShapeOf/Indices221613932" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="54" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="LSTM_7/Split/reverse/ShapeOf/Axis221713881" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="32" name="LSTM_7/Split/reverse/ShapeOf/Gather" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="LSTM_7/Split/reverse/HiddenStateResizeDim/value222114019" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="46" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="LSTM_7/Split/reverse/HiddenStateResizeDim" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="LSTM_7/Split/reverse/HiddenStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="LSTM_7/Split/reverse/CellStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="LSTM_7/Split/reverse/TensorIterator" type="TensorIterator" version="opset1">
			<port_map>
				<input axis="0" external_port_id="0" internal_layer_id="2" start="-1" end="0" stride="-1" part_size="1"/>
				<input external_port_id="1" internal_layer_id="1"/>
				<input external_port_id="2" internal_layer_id="0"/>
				<output axis="0" external_port_id="3" internal_layer_id="11" start="-1" end="0" stride="-1" part_size="1"/>
				<output external_port_id="4" internal_layer_id="13"/>
				<output external_port_id="5" internal_layer_id="12"/>
			</port_map>
			<back_edges>
				<edge from-layer="13" to-layer="1"/>
				<edge from-layer="12" to-layer="0"/>
			</back_edges>
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="0" name="24" type="Parameter" version="opset1">
						<data shape="1, 512" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="22" type="Parameter" version="opset1">
						<data shape="1, 512" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="20" type="Parameter" version="opset1">
						<data shape="1, 1, 512" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="7250" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="38" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="LSTM_7/Split/reverse/input_squeeze" type="Squeeze" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="LSTM_7/Split/reverse/LSTMCell/Split197253" type="Const" version="opset1">
						<data element_type="f16" shape="2048, 512" offset="4198458" size="2097152"/>
						<output>
							<port id="0" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="LSTM_7/Split/reverse/LSTMCell/Split198256" type="Const" version="opset1">
						<data element_type="f16" shape="2048, 512" offset="6295610" size="2097152"/>
						<output>
							<port id="0" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="LSTM_7/Split/reverse/inport/2247" type="Const" version="opset1">
						<data element_type="f16" shape="2048" offset="8392762" size="4096"/>
						<output>
							<port id="0" precision="FP16">
								<dim>2048</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="LSTM_7/Split/reverse/LSTMCell" type="LSTMCell" version="opset4">
						<data hidden_size="512" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0"/>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="3" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
							<port id="4" precision="FP16">
								<dim>2048</dim>
								<dim>512</dim>
							</port>
							<port id="5" precision="FP16">
								<dim>2048</dim>
							</port>
						</input>
						<output>
							<port id="6" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="7" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="15244" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="38" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="LSTM_7/Split/reverseoutput_unsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="18/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
					<layer id="12" name="LSTM_7/Split/reverse/outport/1/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
					<layer id="13" name="LSTM_7/Split/reverse/outport/0/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="8" to-port="2"/>
					<edge from-layer="1" from-port="0" to-layer="8" to-port="1"/>
					<edge from-layer="2" from-port="0" to-layer="4" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
					<edge from-layer="4" from-port="2" to-layer="8" to-port="0"/>
					<edge from-layer="5" from-port="0" to-layer="8" to-port="3"/>
					<edge from-layer="6" from-port="0" to-layer="8" to-port="4"/>
					<edge from-layer="7" from-port="0" to-layer="8" to-port="5"/>
					<edge from-layer="8" from-port="6" to-layer="10" to-port="0"/>
					<edge from-layer="8" from-port="7" to-layer="12" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="13" to-port="0"/>
					<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
					<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="38" name="220913887" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="LSTM_7/Split/reverse/UnsqueezeNumDirections/2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="LSTM_7/FinalConcat/CellState" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="LSTM_7/FinalConcat/CellState/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
		</layer>
		<layer id="42" name="223513821" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="LSTM_7/Split/forward/UnsqueezeNumDirections/1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="220514064" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="LSTM_7/Split/reverse/UnsqueezeNumDirections/1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="LSTM_7/FinalConcat/HiddenState" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="LSTM_7/FinalConcat/HiddenState/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
		</layer>
		<layer id="48" name="223113668" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8396858" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="LSTM_7/Split/forward/UnsqueezeNumDirections/0" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="220113752" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8396858" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="LSTM_7/Split/reverse/UnsqueezeNumDirections/0" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="LSTM_7/FinalConcat/Data" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="386">
					<dim>805</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="249" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8396866" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Transpose_8" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="389">
					<dim>805</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8396898" size="24"/>
			<output>
				<port id="0" precision="I64" names="390">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_10" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="391">
					<dim>805</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="243" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose_11" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>805</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="392">
					<dim>1</dim>
					<dim>805</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="734" type="Const" version="opset1">
			<data element_type="f16" shape="80, 1024" offset="8396922" size="163840"/>
			<output>
				<port id="0" precision="FP16" names="734">
					<dim>80</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="MatMul_12" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>805</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="394">
					<dim>1</dim>
					<dim>805</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model.lin.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 80" offset="8560762" size="160"/>
			<output>
				<port id="0" precision="FP16" names="model.lin.bias">
					<dim>1</dim>
					<dim>1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Add_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>805</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="395">
					<dim>1</dim>
					<dim>805</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="244" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8560922" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Transpose_14" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>805</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="396">
					<dim>1</dim>
					<dim>80</dim>
					<dim>805</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model.postnet.cbhg.conv1d_bank.0.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="256, 80, 1" offset="8560946" size="40960"/>
			<output>
				<port id="0" precision="FP16" names="model.postnet.cbhg.conv1d_bank.0.conv.weight">
					<dim>256</dim>
					<dim>80</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_18" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>805</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>80</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="400">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="401">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="data_mul_56735677" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="8601906" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="BatchNormalization_20/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_add_56745679" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="8602418" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="BatchNormalization_20/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="402">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Slice_23/Concat301514103" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8602930" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Slice_23/Const3009301013854" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Slice_23/Const3011301214016" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Shape_15" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>805</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="397">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_16" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8602954" size="4"/>
			<output>
				<port id="0" precision="I32" names="398"/>
			</output>
		</layer>
		<layer id="77" name="Gather_17/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="78" name="Gather_17282" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="399"/>
			</output>
		</layer>
		<layer id="79" name="Unsqueeze_21/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Unsqueeze_21/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="406">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Slice_23/Clamp2994" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Slice_23/Gather3002_input_port_1/value300414130" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="34" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Slice_23/Gather3002_input_port_2/value300614013" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="84" name="Slice_23/Gather3002" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Slice_23/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Slice_23/Strides301714043" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8602958" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Slice_23" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="409">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model.postnet.cbhg.conv1d_bank.1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" shape="256, 80, 2" offset="8602982" size="81920"/>
			<output>
				<port id="0" precision="FP16" names="model.postnet.cbhg.conv1d_bank.1.conv.weight">
					<dim>256</dim>
					<dim>80</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_24" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>805</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>80</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="410">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Relu_25" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="411">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_mul_56655669" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="8684902" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="BatchNormalization_26/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_56665671" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1" offset="8685414" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="BatchNormalization_26/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="412">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Slice_29/Concat305914142" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8602930" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Slice_29/Const3053305413959" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Slice_29/Const3055305613920" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Unsqueeze_27/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Unsqueeze_27/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="416">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Slice_29/Clamp3038" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Slice_29/Gather3046_input_port_1/value304813983" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="34" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Slice_29/Gather3046_input_port_2/value305014022" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="103" name="Slice_29/Gather3046" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Slice_29/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Slice_29/Strides306114067" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8602958" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Slice_29" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>806</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="419">
					<dim>1</dim>
					<dim>256</dim>
					<dim>805</dim>
				</port>
			</output>
		</layer>
