<?xml version="1.0" ?>
<net name="wavernn-upsampler" version="10">
	<layers>
		<layer id="0" name="mels" type="Parameter" version="opset1">
			<data shape="1, 200, 80" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="mels">
					<dim>1</dim>
					<dim>200</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="216" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_0" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>200</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191">
					<dim>1</dim>
					<dim>80</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model.upsample.resnet.conv_in_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 80, 5" offset="24" size="204800"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.conv_in_f.weight">
					<dim>128</dim>
					<dim>80</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>200</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>80</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv_1/Dims2128" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="204824" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="192">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="193">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model.upsample.resnet.layers.0.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="205336" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.0.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_3/Dims2170" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="270872" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="194">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="195">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model.upsample.resnet.layers.0.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="271384" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.0.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_5/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_5/Dims2230" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="336920" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="196">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="197">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model.upsample.resnet.layers.1.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="337432" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.1.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_7/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_7/Dims2212" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="402968" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="198">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Relu_8" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="199">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model.upsample.resnet.layers.1.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="403480" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.1.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_9/Dims2182" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="469016" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="200">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Add_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="201">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model.upsample.resnet.layers.2.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="469528" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.2.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_11/Dims2146" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="535064" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="202">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Relu_12" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="203">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model.upsample.resnet.layers.2.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="535576" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.2.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_13/Dims2140" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="601112" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Add_14" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="205">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model.upsample.resnet.layers.3.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="601624" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.3.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_15/Dims2176" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="667160" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Relu_16" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="207">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model.upsample.resnet.layers.3.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="667672" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.3.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_17/Dims2158" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="733208" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Add_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="209">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model.upsample.resnet.layers.4.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="733720" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.4.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_19/Dims2200" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="799256" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="210">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Relu_20" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="211">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model.upsample.resnet.layers.4.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="799768" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.4.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_21/Dims2218" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="865304" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="212">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Add_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model.upsample.resnet.layers.5.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="865816" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.5.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_23/Dims2224" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="931352" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Relu_24" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="215">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model.upsample.resnet.layers.5.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="931864" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.5.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_25/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_25/Dims2164" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="997400" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_25" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="216">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Add_26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="217">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model.upsample.resnet.layers.6.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="997912" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.6.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_27/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_27/Dims2152" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1063448" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_27" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="218">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Relu_28" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="219">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model.upsample.resnet.layers.6.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1063960" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.6.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_29/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_29/Dims2206" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1129496" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_29" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="220">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Add_30" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="221">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model.upsample.resnet.layers.7.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1130008" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.7.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_31/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_31/Dims2122" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1195544" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="222">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Relu_32" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="223">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model.upsample.resnet.layers.7.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1196056" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.7.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_33/Dims2194" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1261592" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="224">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Add_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="225">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model.upsample.resnet.layers.8.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1262104" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.8.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_35/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_35/Dims2242" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1327640" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="226">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Relu_36" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="227">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="model.upsample.resnet.layers.8.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1328152" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.8.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_37/Dims2248" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1393688" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="228">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Add_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="229">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model.upsample.resnet.layers.9.conv1_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1394200" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.9.conv1_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_39/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_39/Dims2236" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1459736" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_39" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="230">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Relu_40" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="231">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="model.upsample.resnet.layers.9.conv2_f.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1460248" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.layers.9.conv2_f.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_41/Dims2188" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1525784" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="232">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Add_42" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="233">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="model.upsample.resnet.conv_out.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1" offset="1526296" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="model.upsample.resnet.conv_out.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_43/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_43/Dims2134" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1" offset="1591832" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="234">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Unsqueeze_44/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1592344" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Unsqueeze_44/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="235">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Shape_63" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="254">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Slice_67/Concat24079499" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1592352" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Slice_67/Concat239724089448" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1592360" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Slice_67/Strides24099268" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1592344" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Slice_67" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="258">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Shape_45" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="236">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_46" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1592368" size="4"/>
			<output>
				<port id="0" precision="I32" names="237"/>
			</output>
		</layer>
		<layer id="121" name="Gather_47/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1592352" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="122" name="Gather_47252" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="238"/>
			</output>
		</layer>
