<?xml version="1.0" ?>
<net name="forward-tacotron-duration-prediction" version="10">
	<layers>
		<layer id="0" name="input_seq" type="Parameter" version="opset1">
			<data shape="1, 241" element_type="i32"/>
			<output>
				<port id="0" precision="I32" names="input_seq">
					<dim>1</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model.embedding.weight" type="Const" version="opset1">
			<data element_type="f32" shape="148, 256" offset="0" size="151552"/>
			<output>
				<port id="0" precision="FP32" names="model.embedding.weight">
					<dim>148</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Gather_0/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="3" name="Gather_0426" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>148</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>241</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="259">
					<dim>1</dim>
					<dim>241</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="371" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="151560" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_26" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>241</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="407">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model.prenet.cbhg.conv1d_bank.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1" offset="151584" size="262144"/>
			<output>
				<port id="0" precision="FP32" names="model.prenet.cbhg.conv1d_bank.0.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_30" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="411">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Relu_31" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="412">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_mul_89868990" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="413728" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="BatchNormalization_32/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="data_add_89878992" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="414752" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="BatchNormalization_32/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="413">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Slice_35/Concat455421776" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415776" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Slice_35/Const4548454921899" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Slice_35/Const4550455121602" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Shape_27" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="408">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_28" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="415800" size="4"/>
			<output>
				<port id="0" precision="I32" names="409"/>
			</output>
		</layer>
		<layer id="18" name="Gather_29/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="19" name="Gather_29432" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="410"/>
			</output>
		</layer>
		<layer id="20" name="Unsqueeze_33/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Unsqueeze_33/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="417">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Slice_35/Clamp4533" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Slice_35/Gather4541_input_port_1/value454321515" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="415804" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Slice_35/Gather4541_input_port_2/value454521737" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="25" name="Slice_35/Gather4541" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Slice_35/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Slice_35/Strides455621494" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415808" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Slice_35" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="420">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model.prenet.cbhg.conv1d_bank.1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 2" offset="415832" size="524288"/>
			<output>
				<port id="0" precision="FP32" names="model.prenet.cbhg.conv1d_bank.1.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_36" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="421">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Relu_37" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="422">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_mul_89788982" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="940120" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="BatchNormalization_38/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_89798984" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="941144" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="BatchNormalization_38/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="423">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Slice_41/Concat459821782" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415776" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Slice_41/Const4592459321605" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Slice_41/Const4594459521665" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Unsqueeze_39/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Unsqueeze_39/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="427">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Slice_41/Clamp4577" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Slice_41/Gather4585_input_port_1/value458721212" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="415804" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Slice_41/Gather4585_input_port_2/value458921374" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="44" name="Slice_41/Gather4585" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Slice_41/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Slice_41/Strides460021509" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415808" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Slice_41" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="430">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model.prenet.cbhg.conv1d_bank.2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3" offset="942168" size="786432"/>
			<output>
				<port id="0" precision="FP32" names="model.prenet.cbhg.conv1d_bank.2.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_42" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="431">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Relu_43" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="432">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_mul_89708974" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="1728600" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="BatchNormalization_44/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_89718976" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="1729624" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="BatchNormalization_44/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="433">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Slice_47/Concat464221371" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415776" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Slice_47/Const4636463721635" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Slice_47/Const4638463921329" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Unsqueeze_45/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Unsqueeze_45/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="437">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Slice_47/Clamp4621" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Slice_47/Gather4629_input_port_1/value463121557" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="415804" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Slice_47/Gather4629_input_port_2/value463321338" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="63" name="Slice_47/Gather4629" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Slice_47/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Slice_47/Strides464421530" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415808" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Slice_47" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="440">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model.prenet.cbhg.conv1d_bank.3.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 4" offset="1730648" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="model.prenet.cbhg.conv1d_bank.3.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_48" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="441">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Relu_49" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="442">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_mul_89628966" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="2779224" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="BatchNormalization_50/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_89638968" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="2780248" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="BatchNormalization_50/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="443">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Slice_53/Concat468621638" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415776" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Slice_53/Const4680468121842" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Slice_53/Const4682468321488" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Unsqueeze_51/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Unsqueeze_51/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="447">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Slice_53/Clamp4665" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Slice_53/Gather4673_input_port_1/value467521299" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="415804" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Slice_53/Gather4673_input_port_2/value467721431" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="82" name="Slice_53/Gather4673" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Slice_53/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Slice_53/Strides468821392" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415808" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Slice_53" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="450">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="model.prenet.cbhg.conv1d_bank.4.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 5" offset="2781272" size="1310720"/>
			<output>
				<port id="0" precision="FP32" names="model.prenet.cbhg.conv1d_bank.4.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_54" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="451">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Relu_55" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="452">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="data_mul_89548958" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="4091992" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="BatchNormalization_56/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_add_89558960" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="4093016" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="BatchNormalization_56/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="453">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Slice_59/Concat473021284" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415776" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Slice_59/Const4724472521479" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Slice_59/Const4726472721938" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Unsqueeze_57/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Unsqueeze_57/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="457">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Slice_59/Clamp4709" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Slice_59/Gather4717_input_port_1/value471921791" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="415804" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Slice_59/Gather4717_input_port_2/value472121683" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="101" name="Slice_59/Gather4717" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Slice_59/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Slice_59/Strides473221302" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415808" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Slice_59" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="460">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="model.prenet.cbhg.conv1d_bank.5.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 6" offset="4094040" size="1572864"/>
			<output>
				<port id="0" precision="FP32" names="model.prenet.cbhg.conv1d_bank.5.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_60" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="3" pads_end="3" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="461">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Relu_61" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="462">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="data_mul_89468950" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="5666904" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="BatchNormalization_62/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="data_add_89478952" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="5667928" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="BatchNormalization_62/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="463">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Slice_65/Concat477421263" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415776" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Slice_65/Const4768476921641" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Slice_65/Const4770477121575" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Unsqueeze_63/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Unsqueeze_63/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="467">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Slice_65/Clamp4753" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Slice_65/Gather4761_input_port_1/value476321935" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="415804" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Slice_65/Gather4761_input_port_2/value476521506" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="120" name="Slice_65/Gather4761" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Slice_65/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Slice_65/Strides477621341" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415808" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Slice_65" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>242</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="470">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="model.prenet.cbhg.conv1d_bank.6.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 7" offset="5668952" size="1835008"/>
			<output>
				<port id="0" precision="FP32" names="model.prenet.cbhg.conv1d_bank.6.conv.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_66" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="3" pads_end="3" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="471">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Relu_67" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="472">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="data_mul_89388942" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="7503960" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="BatchNormalization_68/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="data_add_89398944" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1" offset="7504984" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="BatchNormalization_68/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="473">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Slice_71/Concat481821569" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415776" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Slice_71/Const4812481321818" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Slice_71/Const4814481521347" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Unsqueeze_69/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Unsqueeze_69/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="477">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Slice_71/Clamp4797" type="Clamp" version="opset1">
			<data min="-2147483648" max="2147483647"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Slice_71/Gather4805_input_port_1/value480721311" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="415804" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Slice_71/Gather4805_input_port_2/value480921740" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="151552" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="139" name="Slice_71/Gather4805" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Slice_71/End" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Slice_71/Strides482021911" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="415808" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="Slice_71" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="480">
					<dim>1</dim>
					<dim>256</dim>
					<dim>241</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="model.prenet.cbhg.conv1d_bank.7.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 8" offset="7506008" size="2097152"/>
			<output>
